{"book": {"id": "5f78cbf3619649dffb198ba2", "isbn": "9780679644385", "title": "The Age of Miracles", "author": "Karen Thompson Walker", "image": "http://books.google.com/books/content?id=P8vrYUO7CMIC&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api", "publication_date": "2012-06-26", "description": "NAMED ONE OF THE BEST BOOKS OF THE YEAR BY People ∙ O: The Oprah Magazine ∙ Financial Times ∙ Kansas City Star ∙ BookPage ∙ Kirkus Reviews ∙ Publishers Weekly ∙ Booklist NEW YORK TIMES BESTSELLER “A stunner.”—Justin Cronin “It’s never the disasters you see coming that finally come to pass—it’s the ones you don’t expect at all,” says Julia, in this spellbinding novel of catastrophe and survival by a superb new writer. Luminous, suspenseful, unforgettable, The Age of Miracles tells the haunting and beautiful story of Julia and her family as they struggle to live in a time of extraordinary change. On an ordinary Saturday in a California suburb, Julia awakes to discover that something has happened to the rotation of the earth. The days and nights are growing longer and longer; gravity is affected; the birds, the tides, human behavior, and cosmic rhythms are thrown into disarray. In a world that seems filled with danger and loss, Julia also must face surprising developments in herself, and in her personal world—divisions widening between her parents, strange behavior by her friends, the pain and vulnerability of first love, a growing sense of isolation, and a surprising, rebellious new strength. With crystalline prose and the indelible magic of a born storyteller, Karen Thompson Walker gives us a breathtaking portrait of people finding ways to go on in an ever-evolving world. “Gripping drama . . . flawlessly written; it could be the most assured debut by an American writer since Jennifer Egan’s Emerald City.”—The Denver Post “Pure magnificence.”—Nathan Englander “Provides solace with its wisdom, compassion, and elegance.”—Curtis Sittenfeld “Riveting, heartbreaking, profoundly moving.”—Kirkus Reviews (starred review) Look for special features inside. Join the Circle for author chats and more."}}